"""Задание
Необходимо спроектировать и создать БД с помощью консоли psql:
БД должна вести учет:
– всех самолетов (добавление, удаление и редактирование информации обо всех видах самолетов, обслуживаемых аэропортом);
– всех рейсов (добавление, удаление и редактирование информации обо всех рейсах с указанием даты отправления и прибытия,
 вида самолета, фамилий членов экипажа);
– билетов (добавление, удаление и редактирование информации о распределении билетов в зависимости от типа самолета,
рейса и др.);
– предварительных заказов билетов (формирование предварительного заказа билетов на конкретный рейс, предоплата билета);
– стоимости билетов (формирование стоимости билета в зависимости от типа самолета, рейса, класса салона);
–пассажиров (добавление, удаление и редактирование информации обо всех пассажирах аэропорта, их багаже, номерах билетов).
Далее необходимо создать дамп 1 БД и восстановить его в новой БД."""